[
  {
    "startTime": "00:00",
    "speaker_name": "Viktor Petersson",
    "sentence": "Welcome to the show, Marc! It's great to have you here today."
  },
  {
    "startTime": "00:05",
    "speaker_name": "Marc Pous",
    "sentence": "Thank you for having me, Viktor. I'm excited to share my experiences and insights about IoT and connected devices."
  },
  {
    "startTime": "00:12",
    "speaker_name": "Viktor Petersson",
    "sentence": "You've been with Balena for almost five years now, and in the IoT space since 2007. Could you tell us about your journey and what led you to Balena?"
  },
  {
    "startTime": "00:20",
    "speaker_name": "Marc Pous",
    "sentence": "Of course. My journey started in academic research, then I moved into entrepreneurship, and now I'm at Balena where we're helping companies manage their IoT device fleets at scale."
  },
  {
    "startTime": "00:35",
    "speaker_name": "Viktor Petersson",
    "sentence": "Let's start with Balena's core mission. What problems are you solving for developers and companies in the IoT space?"
  },
  {
    "startTime": "00:42",
    "speaker_name": "Marc Pous",
    "sentence": "Our core mission is enabling developers to manage fleets of IoT devices efficiently. We handle everything from remote management to over-the-air updates for hundreds of thousands of devices."
  },
  {
    "startTime": "01:00",
    "speaker_name": "Viktor Petersson",
    "sentence": "Could you explain how Balena OS and Docker containers fit into this picture?"
  },
  {
    "startTime": "01:07",
    "speaker_name": "Marc Pous",
    "sentence": "Balena OS is our Linux-based operating system that exclusively runs Docker containers. This brings modern DevOps practices to embedded devices, making it much easier to manage and update applications."
  },
  {
    "startTime": "01:25",
    "speaker_name": "Viktor Petersson",
    "sentence": "Let's talk about the technical architecture. How do you support such a wide range of devices?"
  },
  {
    "startTime": "01:32",
    "speaker_name": "Marc Pous",
    "sentence": "We use Yocto to build Balena OS, which allows us to support over 100 different ARM devices and x86 platforms. Our Autokit testing infrastructure ensures reliable updates across all these devices."
  },
  {
    "startTime": "01:50",
    "speaker_name": "Viktor Petersson",
    "sentence": "Security is a crucial aspect of IoT. How does Balena approach device security?"
  },
  {
    "startTime": "01:57",
    "speaker_name": "Marc Pous",
    "sentence": "Security is built into every layer. We implement secure boot, full disk encryption, and our container-based approach provides isolation. We also emphasize the importance of regular updates."
  },
  {
    "startTime": "02:15",
    "speaker_name": "Viktor Petersson",
    "sentence": "Speaking of updates, could you share some real-world examples of why OTA updates are so critical?"
  },
  {
    "startTime": "02:22",
    "speaker_name": "Marc Pous",
    "sentence": "I remember one company that had to physically replace 500 devices because they didn't have proper update capabilities. It's a costly lesson that demonstrates why OTA updates are essential from day one."
  },
  {
    "startTime": "02:40",
    "speaker_name": "Viktor Petersson",
    "sentence": "The EU Cyber Resilience Act is coming up. How will this affect IoT companies?"
  },
  {
    "startTime": "02:47",
    "speaker_name": "Marc Pous",
    "sentence": "The CRA will fundamentally change how companies approach IoT security. It requires proper security assessments, SBOMs, regular updates, and clear product lifecycle management. Companies need to prepare now."
  },
  {
    "startTime": "03:10",
    "speaker_name": "Viktor Petersson",
    "sentence": "How do you see IoT business models evolving?"
  },
  {
    "startTime": "03:15",
    "speaker_name": "Marc Pous",
    "sentence": "We're seeing a shift from one-time sales to ongoing service relationships. Successful IoT projects focus on clear ROI and sustainable business models rather than just adding connectivity for its own sake."
  },
  {
    "startTime": "03:35",
    "speaker_name": "Viktor Petersson",
    "sentence": "What's your perspective on the future of IoT?"
  },
  {
    "startTime": "03:40",
    "speaker_name": "Marc Pous",
    "sentence": "Interestingly, I think the term 'IoT' might disappear as connectivity becomes an expected feature. We're moving towards a world where everything is just a 'connected product' rather than specifically an IoT device."
  },
  {
    "startTime": "04:00",
    "speaker_name": "Viktor Petersson",
    "sentence": "For developers wanting to get started, what resources would you recommend?"
  },
  {
    "startTime": "04:07",
    "speaker_name": "Marc Pous",
    "sentence": "I'd recommend exploring our open source projects and documentation at balena.io. Whether you use Balena Cloud or Open Balena, we provide a proven path to managing connected devices at scale."
  },
  {
    "startTime": "04:25",
    "speaker_name": "Viktor Petersson",
    "sentence": "Thank you for sharing your insights today, Marc. This has been incredibly informative."
  },
  {
    "startTime": "04:32",
    "speaker_name": "Marc Pous",
    "sentence": "Thank you for having me, Viktor. It's been a pleasure discussing these important topics."
  }
]
